---
kind: other
id: Methods.T:Autodesk.Revit.DB.PerformanceAdviserRuleId
source: html/60d4402f-f14e-0148-8689-4cd6f818f34f.htm
---
# PerformanceAdviserRuleId Methods

Compares two Guid-based enum object based on their concrete class and GUID value.